--DROP TABLE `product`;
CREATE TABLE `product` (
  `category` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `name` char(50) COLLATE utf8_unicode_ci NOT NULL,
  `count` int(20) NOT NULL,
  `price` int(20) NOT NULL
)
COLLATE='utf8_general_ci'
ENGINE=InnoDB
DEFAULT CHARSET=utf8
;


--
-- 테이블의 덤프 데이터 `product`
--

INSERT INTO `product` (`category`, `name`, `count`, `price`) VALUES
('drink', '레몬에이드', 100, 1300),
('snack', '차카니', 1000, 300),
('noodle', '진짬뽕', 100, 3000),
('snack', '아폴로', 200, 100),
('drink', '닥터페퍼', 20, 1300),
('drink', '웰치스포도', 100, 1300),
('noodle', '팔도비빔면', 100, 2500),
('noodle', '간짬뽕', 100, 2500),
('drink', '레몬녹차', 100, 1500),
('noodle', '나가사끼', 100, 2500),
('snack', '포카칩', 100, 10),
('drink', '스파클링망고', 100, 1300),
('snack', '예감', 10, 1000),
('drink', '펩시', 100, 1300),
('drink', '웰치스청포도', 100, 1300),
('drink', '웰치스딸기', 100, 1300),
('noodle', '너구리', 100, 2500),
('snack', '바나나킥', 1000, 1300),
('snack', '스윙칩', 1000, 1300),
('snack', '롯데샌드', 1000, 1300),
('snack', '다이제', 1000, 2000),
('snack', '허니버터칩', 100, 1300),
('snack', '왕소라', 1000, 1300),
('snack', '양파링', 200, 1300),
('snack', '오감자', 100, 1300),
('snack', '포스틱', 300, 1300),
('snack', '바나나킥', 1000, 1300),
('drink', '맥콜', 100, 1300),
('drink', '밀키스', 100, 1300),
('drink', '블루하와이', 100, 1300),
('drink', '샤인온더비치', 100, 1300),
('drink', '스프라이트', 100, 1300),
('drink', '에플에이드', 100, 1300),
('drink', '옥수수수염차', 100, 1500),
('drink', '자몽소다', 100, 1300),
('drink', '체리에이드', 100, 2000),
('drink', '체리콕', 100, 2000),
('drink', '코코팜포도', 100, 1300),
('dirnk', '코코팜피치', 100, 1300),
('dirnk', '코코팜화이트요구르트', 100, 1300),
('dirnk', '탄산(마운틴듀)', 100, 1000),
('dirnk', '탄산(미란다)', 100, 1000),
('dirnk', '탄산(사이다)', 100, 1000),
('dirnk', '탄산(콜라)', 100, 1000),
('dirnk', '파워에이드', 100, 1300),
('dirnk', '포카리스웨트', 100, 1300),
('dirnk', '하늘보리', 100, 1500),
('dirnk', '핫식스', 100, 1500),
('dirnk', '헛개차', 100, 1500),
('dirnk', '후르츠펀치', 100, 1300),
('noodle', '무파마', 100, 2500),
('noodle', '불닭볶음면', 100, 2500),
('noodle', '사천짜파게티', 100, 2500),
('noodle', '삼양라면', 100, 2500),
('noodle', '스파게티', 100, 2500),
('noodle', '신라면', 100, 2500),
('noodle', '오징어짬뽕', 100, 2500),
('noodle', '진라면', 100, 2500);